//
//  GPSStationArray.m
//  MapApplication_lesson#3
//
//  Created by Sergey Yasnetsky on 13.05.15.
//  Copyright (c) 2015 Sergey Yasnetsky. All rights reserved.
//

#import "GPSStationArray.h"

@implementation GPSStationArray

- (void) metroStationGPS {
    
//    NSMutableArray * gPSStationArray = [[NSMutableArray alloc] init];

    
NSString * nameOfMetroStation = @"Аэропорт,Академическая,Алексеевская,Александровский сад,Алтуфьево,Аннино,Арбатская,Авиамоторная,Автозаводская,Бабушкинская,Багратионовская,Баррикадная,Бауманская,Беговая,Белорусская,Беляево,Бибирево,Библиотека им. Ленина,Битцевский парк,Боровицкая,Ботанический сад,Братеево,Братиславская,Чеховская,Черкизовская,Чертаново,Чистые пруды,Чкаловская,Динамо,Бульвар Дмитрия Донского,Дмитровская,Добрынинская,Домодедовская,Достоевская,Дубровка,Электрозаводская,Шоссе энтузиастов,Филевский парк,Фили,Фрунзенская,Измайловская,Улица Академика Янгеля,Каховская,Калужская,Кантемировская,Каширская,Киевская,Китай город,Китай город,Коломенское,Комсомольская,Коньково,Кожуховская,Красногвардейская,Краснопресненская,Красносельская,Красные ворота,Крестьянская застава,Кропоткинская,Крылатское,Кунцевская,Курская,Кутузовская,Кузьминки,Кузнецкий мост,Ленинский проспект,Лубянка,Люблино,Марьина роща,Марьино,Марксистская,Маяковская,Медведково,Менделеевская,Минская,Проспект мира,Митино,Молодежная,Нагатинская,Нагорная,Нахимовский проспект,Новые черемушки,Новогиреево,Новокосино,Новокузнецкая,Новослободская,Охотный ряд,Октябрьское поле,Октябрьская,Орехово,Отрадное,Парк культуры,Парк Победы,Партизанская,Павелецкая,Печатники,Перово,Первомайская,Петровско-Разумовская,Пионерская,Планерная,Площадь Ильича,Улица Подбельского,Улица Подбельского,Полежаевская,Полянка,Пражская,Преображенская площадь,Профсоюзная,Пролетарская,Пронска,Пушкинская,Речной вокзал,Площадь Революции,Рижская,Римская,Рязанский проспект,Cавеловская,Щелковская,Щукинская,Cеменовская,Cерпуховская,Cевастопольская,Шаболовская,Cходненская,Cлавянский бульвар,Cмоленская,Cокол,Cокольники,Cпортивная,Cретенский бульвар,Cтрогино,Cтуденческая,Cухаревская,Площадь Cуворова,Cвиблово,Таганская,Театральная,Текстильшики,Теплый стан,Тимирязевская,Третьяковская,Трубная,Царицино,Цветной бульвар,Тульская,Тургеневская,Тушинская,Тверская,Улица 1905 года,Университет,Варшавская,ВДНХ,Проспект Вернадского,Владыкино,Водный стадион,Войковская,Волоколамская,Волгоградский проспект,Волжская,Воробьёвы горы,Выхино,Ясенево,Юго-западная,Южная"; //массив букв - для подписи полей

//NSArray * arrayOfMetroStationName = [nameOfMetroStation componentsSeparatedByString:@","];

}

@end
